<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Twine 2.</string>
	<key>Identifier</key>
	<string>com.github.denmoff.download.Twine2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Twine 2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
        <array>
	<dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>klembot/twinejs</string>
        </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        </dict>
       <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/App</string>
            </dict>
        </dict>
        <dict>
	<key>Processor</key>
	<string>EndOfCheckPhase</string>
        </dict>
        </array>
</dict>
</plist>
