<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Downloads the latest version of BusyCal.</string>
        <key>Identifier</key>
        <string>com.github.scriptingosx.download.BusyCal</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>BusyCal</string>
                <key>url</key>
                <string>https://www.busymac.com/download/BusyCal.zip</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.2</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Arguments</key>
                        <dict/>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                </dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>destination_path</key>
                                <string>%RECIPE_CACHE_DIR%/downloads/pkg</string>
                                <key>purge_destination</key>
                                <true/>
                        </dict>
                        <key>Processor</key>
                        <string>Unarchiver</string>
                </dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>expected_authority_names</key>
                                <array>
                                        <string>Developer ID Installer: Busy Apps FZE (N4RA379GBW)</string>
                                        <string>Developer ID Certification Authority</string>
                                        <string>Apple Root CA</string>
                                </array>
                                <key>input_path</key>
                                <string>%RECIPE_CACHE_DIR%/downloads/pkg/BusyCal Installer.pkg</string>
                        </dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                </dict>
        </array>
</dict>
</plist>
